#include "snake.h"

/****************************************************
	函数功能：判断蛇是否吃到食物
	参数说明：蛇的头指针
	返回值  ：1代表吃到，0代表没吃到
****************************************************/
int is_eat_food(snake s)
{
    if (s->x == fd.x && s->y == fd.y) return 1;
    return 0;
}

/****************************************************
	函数功能：判断蛇是否存活
	参数说明：蛇的头指针
	返回值  ：1代表活着，0代表死了
****************************************************/
int is_alive(snake s)
{
    if (s->x == 0 || s->x == WIDTH_WALL) return 0;
    else if (s->y == 0 || s->y == LENTH_WALL) return 0;
    else {
        snake p = s->next;
        while (p) {
            if (p->x == s->x && p->y == s->y) return 0;
            p = p->next;
        }
    }
    return 1;
}

/****************************************************
	函数功能：判断食物是否放在空着的地方
	参数说明：食物的横纵坐标，蛇的头指针
	返回值  ：1代表不可以放在这，0代表可以
****************************************************/
int place_ok(int x, int y, snake s)
{
    snake p;
    p = s;
    while (p) {
        if (x == p->x && y == p->y) return 1;
        p = p->next;
    }
    return 0;
}